<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 象棋相關設定
    |--------------------------------------------------------------------------
    |
    |
    */
    //後台設置籌碼參數組合清單
    'chips' => [
        '100' => 100,
        '500' => 500,
        '1K' => 1000,
        '5K' => 5000,
        '10K' => 10000,
        '50K' => 50000,
        '100K' => 100000
    ],
    //象棋紅黑顏色
    'colors' => [
        '0' => '#FF0000',
        '1' => '#000000'
    ],
    //象棋紅黑說明
    'color_type' => [
        '0' => ['name'=> '紅多', 'color'=> '#FF0000'],
        '1' => ['name'=> '黑多', 'color'=> '#000000']
    ],
    //象棋代號轉換
    'chess_to_number' => [
        'king' => [
            'name' => '將帥',
            'numbers' => [1,2],
        ],
        'guard' => [
            'name' => '士',
            'numbers' => [3,5]
        ],
        'advisor' => [
            'name' => '仕', 
            'numbers' => [4,6]
        ],
        'elephant' => [
            'name' => '象',
            'numbers' => [7,9]
        ],
        'minister' => [
            'name' => '相',
            'numbers' => [8,10]
        ],
        'car' => [
            'name' => '車',
            'numbers' => [11,13]
        ],
        'rook' => [
            'name' => '俥',
            'numbers' => [12,14]
        ],
        'horse' => [
            'name' => '馬',
            'numbers' => [15,17],
        ],
        'knight' => [
            'name' => '傌',
            'numbers' => [16,18],
        ],
        'bag' => [
            'name' => '包',
            'numbers' => [19,21],
        ],
        'canoon' => [
            'name' => '砲',
            'numbers' => [20,22],
        ],
        
    ],
    //象棋資料庫id對應轉換
    'number_to_chess' => [
        '1' => [
            'chess' => '將',
            'color' => '#000000',
        ],
        '2' => [
            'chess' => '帥',
            'color' => '#FF0000',
        ],
        '3' => [
            'chess' => '士',
            'color' => '#000000',
        ],
        '4' => [
            'chess' => '仕',
            'color' => '#FF0000',
        ],
        '5' => [
            'chess' => '士',
            'color' => '#000000',
        ],
        '6' => [
            'chess' => '仕',
            'color' => '#FF0000',
        ],
        '7' => [
            'chess' => '象',
            'color' => '#000000',
        ],
        '8' => [
            'chess' => '相',
            'color' => '#FF0000',
        ],
        '9' => [
            'chess' => '象',
            'color' => '#000000',
        ],
        '10' => [
            'chess' => '相',
            'color' => '#FF0000',
        ],
        '11' => [
            'chess' => '車',
            'color' => '#000000',
        ],
        '12' => [
            'chess' => '俥',
            'color' => '#FF0000',
        ],
        '13' => [
            'chess' => '車',
            'color' => '#000000',
        ],
        '14' => [
            'chess' => '俥',
            'color' => '#FF0000',
        ],
        '15' => [
            'chess' => '馬',
            'color' => '#000000',
        ],
        '16' => [
            'chess' => '傌',
            'color' => '#FF0000',
        ],
        '17' => [
            'chess' => '馬',
            'color' => '#000000',
        ],
        '18' => [
            'chess' => '傌',
            'color' => '#FF0000',
        ],
        '19' => [
            'chess' => '包',
            'color' => '#000000',
        ],
        '20' => [
            'chess' => '砲',
            'color' => '#FF0000',
        ],
        '21' => [
            'chess' => '包',
            'color' => '#000000',
        ],
        '22' => [
            'chess' => '砲',
            'color' => '#FF0000',
        ],
        
    ]


];
