<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 網站內容相關設定
    |--------------------------------------------------------------------------
    |
    |
    */

    'news' => [
        'status' => [
            '0' => '<span style="color:red;">關閉</span>',
            '1' => '<span style="color:green;">顯示</span>'
        ]
        
    ],
    'page' => [

        'status' => [
            '0' => '<span style="color:red;">關閉</span>',
            '1' => '<span style="color:green;">開放</span>'
        ]
    ]


];
