<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 會員相關設定
    |--------------------------------------------------------------------------
    |
    |
    */
    //登入權限狀態
    'user' => [
        'login_permission' => [
            '0' => '<span style="color:red;">關閉</span>',
            '1' => '<span style="color:green;">開放</span>'
        ]
        
    ],
    'status' => [

        '0' => '<span style="color:red;">否</span>',
        '1' => '<span style="color:green;">是</span>'
    ],
    'account' => [
        //帳戶類型代號->名稱
        'type' => [
            '1' => '金幣',
            '2' => '禮券',
            '3' => '娛樂幣',
            '4' => '紅利點數',
            '5' => '專屬娛樂幣'
        ],
        //帳戶類型icon  可以直接換成圖片<img src=''>  or 圖示 <i class='fa fa-beer'></i>
        'type_icon' => [
            '1' => "",
            '2' => "",
            '3' => "",
            '4' => "",
            '5' => "",
        ],
        //帳戶轉帳類型
        'transfer_type' => [
            '1' => '購買金幣',
            '2' => '使用紅包卡',
            '3' => '簽到中心',
            '4' => '下注',
            '5' => '手續費',
            '6' => '公司發紅包',
            '7' => '商城',
            '8' => '紅包群發',
            '9' => '購買娛樂幣',
            '10' => '專屬娛樂幣',
            '11' => '購買專屬娛樂幣',
            '12' => '下注開盤',
            '13' => '紅利回收',
            '14' => '拍賣單新增',
            '15' => '拍賣單成交',
            '16' => '拍賣單取消',
            '17' => '紅包群發',
        ]
    ],
    //時間區間
    'range' => [
        'today' => '今日',
        'yesterday' => '昨日',
        'this_week' => '本週',
        'last_week' => '上週',
        'this_month' => '本月',
        'last_month' => '上月',
    ],
    //包含全部的時間區間
    'all_range' => [
        'all' => '全部',
        'today' => '今日',
        'yesterday' => '昨日',
        'this_week' => '本週',
        'last_week' => '上週',
        'this_month' => '本月',
        'last_month' => '上月',

    ],
    //過戶處理狀態
    'transfer_ownership_record' => [
        'status' => [
            '0' => '申請中',
            '1' => '已確認',
            '2' => '拒絕'
        ]
    ]


];
